app/controllers/cards_controller.rb

  def new
    @deck = Deck.find(params[:deck_id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "17"]]

  def create
    @deck = Deck.find(params[:deck_id])
    card = @deck.cards.create(card_params)
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "17"]]
INSERT INTO "cards" ("back", "created_at", "deck_id", "front", "updated_at") VALUES (?, ?, ?, ?, ?)  [["back", "Back"], ["created_at", Tue, 14 May 2013 15:31:09 UTC +00:00], ["deck_id", 17], ["front", "Front"], ["updated_at", Tue, 14 May 2013 15:31:09 UTC +00:00]]

  def edit
    @deck = Deck.find(params[:deck_id])
    @card = Card.find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "17"]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", "5"]]

  def update
    @deck = Deck.find(params[:deck_id])
    @card = Card.find(params[:id])
    @card.update card_params
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "17"]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "cards" SET "front" = ?, "updated_at" = ? WHERE "cards"."id" = 5  [["front", "Racoon Dogs"], ["updated_at", Tue, 14 May 2013 15:42:17 UTC +00:00]]

  def destroy
    @deck = Deck.find(params[:deck_id])
    card = Card.find(params[:id])
    card.destroy
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "17"]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 9]]