app/controllers/decks_controller.rb

  def index
    @decks = Deck.all
---
SELECT "decks".* FROM "decks"

  def show
    @deck = Deck.find(params[:id])
    @cards = @deck.cards.order(:created_at).reverse_order
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = ? ORDER BY "cards".created_at DESC  [["deck_id", 17]]

  def create
    deck = Deck.create(deck_params)
---
INSERT INTO "decks" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 13 May 2013 20:01:26 UTC +00:00], ["name", ""], ["updated_at", Mon, 13 May 2013 20:01:26 UTC +00:00]]

  def edit
    @deck = Deck.find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "4"]]

  def update
    @deck = Deck.find(params[:id])
    @deck.update deck_params
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "decks" SET "name" = ?, "updated_at" = ? WHERE "decks"."id" = 4  [["name", "Deck 12"], ["updated_at", Mon, 13 May 2013 20:40:05 UTC +00:00]]

  def destroy
    deck = Deck.find(params[:id])
    deck.destroy
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "15"]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 15]]